In [1]:
try:
    file=open('data.csv','x')
    file.close()
except:
    print("The file is already there")

In [17]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\nikita uprety\anaconda3\lib\site-packages (1.4.4)
Requirement already satisfied: numpy>=1.18.5 in c:\users\nikita uprety\anaconda3\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\nikita uprety\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\nikita uprety\anaconda3\lib\site-packages (from pandas) (2022.1)
Requirement already satisfied: six>=1.5 in c:\users\nikita uprety\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [3]:
import pandas as pd
df = pd.read_csv('data.csv', nrows=5)
df

   sn   name  age        add       phone
0   1    Ram   23  Kathmandu  9860826004
1   2  Shyam   24  Bhaktapur    98777000
2   3   Hari   21   Lalitpur  9806667774
3   4  Nabin   26       Bara   980992212
4   5   Sita   25    Chitwan   977765249

In [5]:
df = pd.read_csv('data.csv', index_col='sn')
df

      name  age        add       phone
sn
1      Ram   23  Kathmandu  9860826004
2    Shyam   24  Bhaktapur    98777000
3     Hari   21   Lalitpur  9806667774
4    Nabin   26       Bara   980992212
5     Sita   25    Chitwan   977765249
6   Nabina   23  Kathmandu   986999872

In [6]:
df = pd.read_csv('data.csv', index_col='name')
df.head(3)

       sn  age        add       phone
name
Ram     1   23  Kathmandu  9860826004
Shyam   2   24  Bhaktapur    98777000
Hari    3   21   Lalitpur  9806667774

In [7]:
df = pd.read_csv('data.csv', index_col='sn')
df.tail(3)

      name  age        add      phone
sn
4    Nabin   26       Bara  980992212
5     Sita   25    Chitwan  977765249
6   Nabina   23  Kathmandu  986999872

In [8]:
df = pd.read_csv('data.csv', index_col='sn')
df.iloc[1:4]

     name  age        add       phone
sn
2   Shyam   24  Bhaktapur    98777000
3    Hari   21   Lalitpur  9806667774
4   Nabin   26       Bara   980992212

In [9]:
df = pd.read_csv('data.csv', index_col='sn')
df.loc[2:5]

     name  age        add       phone
sn
2   Shyam   24  Bhaktapur    98777000
3    Hari   21   Lalitpur  9806667774
4   Nabin   26       Bara   980992212
5    Sita   25    Chitwan   977765249

In [15]:
df = pd.read_csv('data.csv', index_col='name')
df.loc['Shyam':'Nabin']

       sn  age        add       phone
name
Shyam   2   24  Bhaktapur    98777000
Hari    3   21   Lalitpur  9806667774
Nabin   4   26       Bara   980992212

In [14]:
df = pd.read_csv('data.csv', index_col='sn')
df['add']

sn
1    Kathmandu
2    Bhaktapur
3     Lalitpur
4         Bara
5      Chitwan
6    Kathmandu
Name: add, dtype: object

In [16]:
df = pd.read_csv('data.csv', index_col='sn')
df['add']=='Kathmandu'

sn
1     True
2    False
3    False
4    False
5    False
6     True
Name: add, dtype: bool

In [18]:
df = pd.read_csv('data.csv', index_col='sn')
df[df['age']>25]

     name  age   add      phone
sn
4   Nabin   26  Bara  980992212

In [20]:
df = pd.read_csv('data.csv', index_col='sn')
df[(df['age']>20) & (df['add']=='Kathmandu')]

      name  age        add       phone
sn
1      Ram   23  Kathmandu  9860826004
6   Nabina   23  Kathmandu   986999872

In [3]:
import pd as pandas
df = pd.read_csv('data.csv', index_col='sn')
data=df[df['age']>25]
data.to_csv('new_data.csv')

ModuleNotFoundError: No module named 'pd'

In [2]:
#list inside dict
data={'name': ['Ram','Shyam','Hari','Sita','Gita'],
      'age':[23,45,67,89,43],
      'addd':['Kathmandu','Bara','Jhapa','Bhaktapur','Lalitpur']}
df=pd.DataFrame(data)
df.to_csv('new_data.csv')
df

NameError: name 'pd' is not defined

In [26]:
file=open('new_data.csv','a')
file.write('\n5,Smaeer,45,Manang,9860822777')
file.close()

In [29]:
df = pd.read_csv('new_data.csv')
df

ParserError: Error tokenizing data. C error: Expected 4 fields in line 9, saw 5

In [5]:
import csv
data=[['name','age','add'],
     ['Ram','24','Kathmandu'],
     ['Shyam','35','Bhaktapur']
     ['Nabin','40','Bara']]
file=open('list_data.csv','w')
x=csv.writer(file)
x.writerows(data)
file.close()

<>:4: SyntaxWarning: list indices must be integers or slices, not tuple; perhaps you missed a comma?
<>:4: SyntaxWarning: list indices must be integers or slices, not tuple; perhaps you missed a comma?
C:\Users\Nikita Uprety\AppData\Local\Temp\ipykernel_3940\821134340.py:4: SyntaxWarning: list indices must be integers or slices, not tuple; perhaps you missed a comma?
  ['Shyam','35','Bhaktapur']

TypeError: list indices must be integers or slices, not tuple

In [6]:
df=pd.read_csv('list_data.csv')
df

NameError: name 'pd' is not defined